{
  "HomePage": {
    "languages": {
      "es": "spanish",
      "en": "english"
    },
    "title": "software developer"
  },
  "AboutPage": {
    "greeting": "HI, I'M",
    "name": "ROSANNA",
    "bio": "I’m a Front-End Developer focused on building clear, smooth, and enjoyable user interfaces. I love turning ideas into real experiences, taking care of both the design and the code behind them. I mainly work with React, React Native, and Next.js, and I especially enjoy bringing projects to life through animations, micro-interactions, and details that truly make a difference. \nI’m curious, consistent, and I enjoy learning by doing. I’ve worked on real projects, collaborating with teams and tackling challenges that helped me grow both technically and professionally. My goal is to keep evolving as a developer, add value through my work, and build products that feel good from the very first scroll."
  },
  "ProjectsPage": {
    "coverTitle": ["FEATURED", "PROJECTS"],
    "sirenasApp": {
      "title": "SIRENAS\nPROJECT\nAPP",
      "description": "The Sirenas Project App was developed to offer users a smooth and intuitive mobile experience, facilitating access to key content, functionalities, and communications of the project."
    },
    "sirenasWeb": {
      "title": "WEB APP SIRENAS.TV",
      "description": "Complete web platform for streaming and multimedia content management. Built with modern technologies to ensure an optimal and scalable user experience."
    },
    "crmSirenas": {
      "title": "SIRENAS PROJECT CRM",
      "description": "CRM for customer and sales management at Sirenas, a company dedicated to selling marine products. This CRM allows users to manage contacts, sales opportunities, interaction tracking, and report generation to optimize the sales process."
    }
  },
  "TechnologiesPage": {
    "coverTitle": ["SKILLS", "TECHNOLOGIES"]
  },
  "ContactPage": {
    "coverTitle": ["LET'S WORK", "TOGETHER!"],
    "contactTitle": "CONTACT",
    "github": "GitHub",
    "linkedin": "LinkedIn",
    "email": "Email"
  }
}